tap 'homebrew/services'
tap 'homebrew/science'
tap 'homebrew/dupes'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'nodenv/nodenv'

# general dependencies
brew 'openssl'
cask 'java' unless system '/usr/libexec/java_home --failfast > /dev/null'

# cli tools
brew 'awscli' # aws command line tools
brew 'wget' # super curl
brew 'jq' # command line json processor
brew 'tree' # recursive ls
brew 'jsonpp' # pretty print json
brew 'docker-clean' # clean dangling docker images
brew 'openconnect' # command line vpn
brew 'zsh' # better shell

# databases, key value stores
brew 'mongodb', restart_service: :changed
brew 'mysql', restart_service: :changed
brew 'postgresql', restart_service: :changed
brew 'redis', restart_service: :changed

# languages
brew 'go'
brew 'maven' # java
brew 'sbt' # scala
brew 'leiningen' # clojure
brew 'gradle' # java, groovy, scala, etc.

brew 'python'
brew 'python3'
brew 'pyenv'

brew 'node'
brew 'node-build'
brew 'nodenv'
brew 'yarn' # alternative to npm

brew 'ruby'
brew 'ruby-build'
brew 'rbenv'

# dev gui
cask 'pritunl' unless File.directory?("/Applications/Pritunl.app")
cask 'docker' unless File.directory?("/Applications/Docker.app")
cask 'sublime-text' unless File.directory?("/Applications/Sublime Text.app")
cask 'atom' unless File.directory?("/Applications/Atom.app")

# non-dev gui
cask 'slack' unless File.directory?("/Applications/Slack.app")
cask 'google-chrome-beta' unless File.directory?("/Applications/Google Chrome.app")
cask 'keepingyouawake' unless File.directory?("/Applications/KeepingYouAwake.app")
